* Aggregate functions
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database workshop
:END:
** Write an SQL query that returns a result table with the name of each device in our database together with the number of parts for that device.
#+BEGIN_SRC sql
  SELECT d.name, COUNT(p.id)
    FROM devices AS d
           INNER JOIN parts AS p
               ON d.id = p.device_id
   GROUP BY d.name;

#+END_SRC

#+RESULTS:
| name          | count |
|---------------+-------|
| Accelerometer |     3 |
| Gyroscope     |     5 |
